app/views/kitchens/show.html.erb

SELECT "reviews".* FROM "reviews" INNER JOIN "bookings" ON "reviews"."booking_id" = "bookings"."id" WHERE "bookings"."kitchen_id" = $1  [["kitchen_id", 89]]
---
        <div class="review-content" >
        <%@kitchen.reviews.each do |review| %>